:PROPERTIES:
:ID:       212a04da-2f2f-42a8-aac3-6cc62a805688
:END:
#+title: AOC 2024

Dit zijn de oplossingen voor [[id:3b4d4e31-7340-4c89-a44d-df55e5d0a3d3][Advent of Code]] 2024.


** ~sum~ over generator

Zie [[id:7153c1e3-c016-46c3-8496-223545c1a19d][2024 Day 1: Historian Hysteria]].

#+caption: liever niet
#+begin_src python
def count_even(numbers:list[int]):
   count = 0
   for n in numbers:
      if n % 2 == 0:
         count += 1
   return count

return count_even([1,2,3,4,5,6,8,10])
#+end_src

#+RESULTS:
: 5

#+caption: liever wel
#+begin_src python
def count_even(numbers:list[int]):
   return sum(not e % 2 for e in numbers)

return count_even([1,2,3,4,5,6,8,10])
#+end_src

#+RESULTS:
: 5

** Delen door een 2-macht is equivalent aan bitshifting

Als je deelt door een macht van twee an afrond naar een integer blijkt dit hetzelfde te zijn als het originele getal te shiften met de macht.

#+begin_src python
getal = 12345
macht = 6

a = getal // (2 ** macht)
b = getal >> macht

return a,b
#+end_src

#+RESULTS:
| 192 | 192 |


[[id:45000afd-9917-49e0-bb97-7d99d38cccde][2024 Day 17: Chronospatial Computer]]
